zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v3.h
#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_SHIELD_EN)
void Cy_CapSense_EnableShieldElectrodes(
                uint32_t chIndex,
                cy_stc_capsense_context_t * context);
void Cy_CapSense_DisableShieldElectrodes(
                uint32_t chIndex,
                cy_stc_capsense_context_t * context);
#endif

#endif /* (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD) */

#if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSD_CALIBRATION_EN) ||\
     (CY_CAPSENSE_ENABLE == CY_CAPSENSE_CSX_CALIBRATION_EN))
cy_capsense_status_t Cy_CapSense_CalibrateSlot(
                uint32_t scanSlotId,
                uint32_t autoCalibrMode,
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_NormalizeCdac(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_CalibrateCompDivider(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_VerifyCalibration(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context);
#endif
cy_capsense_status_t Cy_CapSense_WaitEndScan(
                uint32_t timeout,
                cy_stc_capsense_context_t * context);
void Cy_CapSense_SetShieldPinsInDefaultState(
                const cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_SwitchHwConfiguration(
                uint32_t configuration,
                cy_stc_capsense_context_t * context);
uint32_t Cy_CapSense_GetLfsrDitherVal(
                uint32_t lfsrBits,
                uint32_t lfsrScale);
uint32_t Cy_CapSense_GetLfsrDitherLimit(
                uint32_t snsClkDivider,
                uint32_t snsClkDividerMin,
                uint32_t ditherLimitPercents,
                uint32_t lfsrScale);
cy_capsense_status_t Cy_CapSense_InitializeSourceSenseClk(
                const cy_stc_capsense_context_t * context);

#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_SMARTSENSE_EN)
cy_capsense_status_t Cy_CapSense_SsAutoTune(
                cy_stc_capsense_context_t * context);
#endif

cy_capsense_mw_state_t Cy_CapSense_MwState_V3(
                const cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_ScanAbort_V3(
                cy_stc_capsense_context_t * context);

#if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
cy_capsense_status_t Cy_CapSense_SlotPinState_V3(
                uint32_t slotId,
                const cy_stc_capsense_electrode_config_t * ptrEltdCfg,
                uint32_t pinState,
                cy_stc_capsense_context_t * context);
#endif

#if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CIC2_FILTER_EN)
    uint32_t Cy_CapSense_GetCIC2SamplesMax(uint32_t cic2Rate);
    uint32_t Cy_CapSense_GetCIC2HwDivider(uint32_t cic2Samples);
#endif /* #if (CY_CAPSENSE_DISABLE != CY_CAPSENSE_CIC2_FILTER_EN) */

cy_capsense_status_t Cy_CapSense_ExecuteSaturatedScan(
                uint32_t * ptrMaxRaw,
                uint32_t scanSlotId,
                uint32_t mode,
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_ConfigureSaturationMode(
                cy_stc_capsense_context_t * context);
uint32_t Cy_CapSense_GetScanWatchdogTime(
                uint32_t scanSlotId,
                cy_stc_capsense_context_t * context);


/** \} \endcond */


/*******************************************************************************
* Local definition
*******************************************************************************/

#define CY_CAPSENSE_MSC_INTR_ALL_MSK                            (MSC_INTR_MASK_SUB_SAMPLE_Msk |\
                                                                 MSC_INTR_MASK_SAMPLE_Msk |\
                                                                 MSC_INTR_MASK_SCAN_Msk |\
                                                                 MSC_INTR_MASK_INIT_Msk |\
                                                                 MSC_INTR_MASK_FRAME_Msk |\
                                                                 MSC_INTR_MASK_CIC2_ERROR_Msk |\
                                                                 MSC_INTR_MASK_CONFIG_REQ_Msk |\
                                                                 MSC_INTR_MASK_FIFO_UNDERFLOW_Msk |\
                                                                 MSC_INTR_MASK_FIFO_OVERFLOW_Msk)


#define CY_CAPSENSE_FW_SHIELD_ACTIVE_AMUX_REG_SW_CSD_SHIELD_VALUE    (0x00000040uL)
#define CY_CAPSENSE_FW_SHIELD_PASSIVE_AMUX_REG_SW_CSD_SHIELD_VALUE   (0x00000050uL)
#define CY_CAPSENSE_FW_NEGATIVE_TX_AMUX_REG_SW_CSD_SHIELD_VALUE      (0x00000060uL)

#define CY_CAPSENSE_CALIBRATION_TIMEOUT                         (1000000uL)
#define CY_CAPSENSE_LOOP_DURATION_CYCLES                        (5u)
#define CY_CAPSENSE_MAX_CH_NUM                                  (4u)
#define CY_CAPSENSE_CDAC_MAX_CODE                               (0xFFu)
#define CY_CAPSENSE_CAL_MIDDLE_VALUE                            (0x80u)

#define CY_CAPSENSE_CAL_MODE_REF_CDAC_SUC_APPR                  (0u)
#define CY_CAPSENSE_CAL_MODE_COMP_CDAC_SUC_APPR                 (2u)
#define CY_CAPSENSE_CAL_MODE_COMP_CDAC_MAX_CODE                 (3u)

#define CY_CAPSENSE_CMOD_AMUX_MSK                               (MSC_SW_SEL_GPIO_SW_CSD_SENSE_Msk |\
                                                                 MSC_SW_SEL_GPIO_SW_CSD_MUTUAL_Msk |\
                                                                 MSC_SW_SEL_GPIO_SW_CSD_POLARITY_Msk |\
                                                                 MSC_SW_SEL_GPIO_SW_DSI_CMOD_Msk |\
                                                                 MSC_SW_SEL_GPIO_SW_DSI_CSH_TANK_Msk)

#define CY_CAPSENSE_FW_CMOD_AMUX_CSD_REG_SW_SEL_GPIO_VALUE      ((4uL << MSC_SW_SEL_GPIO_SW_CSD_SENSE_Pos) |\
                                                                 (2uL << MSC_SW_SEL_GPIO_SW_CSD_POLARITY_Pos) |\
                                                                 (3uL << MSC_SW_SEL_GPIO_SW_DSI_CMOD_Pos) |\
                                                                 (3uL << MSC_SW_SEL_GPIO_SW_DSI_CSH_TANK_Pos))

#define CY_CAPSENSE_FW_CMOD_AMUX_CSX_REG_SW_SEL_GPIO_VALUE      ((2uL << MSC_SW_SEL_GPIO_SW_CSD_SENSE_Pos) |\
                                                                 (1uL << MSC_SW_SEL_GPIO_SW_CSD_MUTUAL_Pos))

#define CY_CAPSENSE_LFSR_RANGE_0_DITHER_MAX                     (2u)
#define CY_CAPSENSE_LFSR_RANGE_1_DITHER_MAX                     (4u)
#define CY_CAPSENSE_LFSR_RANGE_2_DITHER_MAX                     (8u)
#define CY_CAPSENSE_LFSR_RANGE_3_DITHER_MAX                     (16u)

#define CY_CAPSENSE_2PH_PRS_SNS_CLOCK_DIVIDER_SHIFT             (1u)
#define CY_CAPSENSE_4PH_PRS_SNS_CLOCK_DIVIDER_SHIFT             (2u)

#define CY_CAPSENSE_DIRECT_SNS_CLOCK_DIVIDER_MAX                (4096u)
#define CY_CAPSENSE_2PH_DIRECT_SNS_CLOCK_DIVIDER_MIN            (4u)
#define CY_CAPSENSE_4PH_DIRECT_SNS_CLOCK_DIVIDER_MIN            (8u)

#define CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_NSUB            (8u)
#define CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_SNS_CLK         (256u)
#define CY_CAPSENSE_SMARTSENSE_PRELIMINARY_SCAN_REF_CDAC        (100u)
#define CY_CAPSENSE_SMARTSENSE_WD_MAX_NUMBER                    (64u)

